# Напишите программу, которая принимает две строки вида “a/b” - дробь с числителем и знаменателем. 
# Программа должна возвращать сумму и произведение* дробей. Для проверки своего кода используйте модуль fractions.

from fractions import Fraction

frac1 = input("Введите первую дробь (в формате a/b): ")
frac2 = input("Введите вторую дробь (в формате a/b): ")

f1 = Fraction(frac1)
f2 = Fraction(frac2)

print(f"Сумма: {f1 + f2}")
print(f"Произведение: {f1 * f2}")
