"""
Задание №2
📌 Создайте функцию аналог get для словаря.
📌 Помимо самого словаря функция принимает ключ и
значение по умолчанию.
📌 При обращении к несуществующему ключу функция должна
возвращать дефолтное значение.
📌 Реализуйте работу через обработку исключений.
"""

my_dict = {1: "один", 2: "одинадцать", 3: "сто один", 4: "сто одинадцать"}


def get_dict(my_dct, key, value="нет значения"):
    try:
        return my_dct[key]
    except KeyError:
        return value


print(get_dict(my_dict, 4))
print(get_dict(my_dict, 7))