# 3. Напишите код, который запрашивает число и сообщает является ли оно простым или составным. Используйте правило для проверки: 
# “Число является простым, если делится нацело только на единицу и на себя”. 
# Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч.


def is_prime(n):
    if n < 2:
        return False
    for i in range(2, int(n**0.5) + 1):
        if n % i == 0:
            return False
    return True

while True:
    try:
        number = int(input("Введите число (от 1 до 100 000): "))
        if 0 < number <= 100000:
            break
        else:
            print("Введенное число должно быть положительным и не превышать 100 000!")
    except ValueError:
        print("Пожалуйста, введите корректное число.")

if is_prime(number):
    print(f"{number} - простое число.")
else:
    print(f"{number} - составное число.")
