# Вспомните какие модули вы уже проходили на курсе. 
# Создайте файл, в котором вы импортируете встроенные в модуль функции под псевдонимами. (3-7 строк импорта).

from math import sqrt as square_root
from math import sin as sine_function
from math import cos as cosine_function
from math import tan as tangent_function
from math import log as logarithm

print(square_root(16))          
print(sine_function(0))        
print(cosine_function(0))      
print(tangent_function(1))     
print(logarithm(100, 10))     

